#include "../s21_string.h"
#include <stdarg.h>
#include <stdio.h>
/*
 * Необходимо реализовать функцию sscanf из библиотеки stdio.h:
 *
 * Функция должна быть размещена в библиотеке s21_string.h.
 * На реализацию функции накладываются все требования, изложенные в первой части.
 * Должно поддерживаться частичное форматирование:
 *
 * Спецификаторы: c, d, i, f, s, u, %
 * Флаги: -, +, (пробел)
 * Ширина: (число)
 * Точность: .(число)
 * Длина: h, l
 *
 * s21_scanf(строка_из_которой_происходит_ввод, "строка_формат(спецификаторы)", &переременные, ...)
 * */
/*============================= Структра списка  ==========================================*/
typedef struct _Node {
    int index;
    void *value;
    struct _Node *next;
    struct _Node *prev;
} Node;
/*============================= Прототипы функций ==========================================*/
/*+++++ LinkedList ++++*/
/*add*/
void add_list(Node* node, void* val);
/*get*/
Node* get_list(Node* node, int index);
/*size*/
int size_list(Node node);
/*сравнивает две строки, возвращает 0 если равны и 1 если нет*/
int equal(const char* s1, const char* s2);
/*переводит строку в целое число*/
int to_int(const char* str);
/*============================= Реализация Основной функции ================================*/
int s21_sscanf(const char *str, const char *format,...) {
//    s_f head;
//    head.index = 0;
//    head.last = NULL;
//    va_list ap;
//    va_start(ap, format);
//    head.info = va_arg(ap,void*);
//    head.next = NULL;
//
//
//
//    printf("--index->%d\n",head.index);
//    add(&head,va_arg(ap,void*));
//    printf("--index->%d\n",head.index);
//    add(&head,va_arg(ap,void*));
//    printf("--index->%d\n",head.index);

//        /*считывание целого числа*/
//        if (!equal(format, "%d")) {
//            int *z = va_arg(ap, int*);
//            int x = to_int(str);
//            *z = x;
//            counter++;
//        }
        /*считывание вещественного числа*/
//
//    va_end(ap);

    return 0;
}
/*============================= методы списка ===========================================================*/

/*добавить*/

/*вернуть элемент по индексу*/

/*длинна списка*/

/*============================= Проверки ================================================================*/
/*++++++ Это целое десятичное число +++++++*/
/*++++++ Это целое восьмеричное число +++++*/
/*++++++ Это целое шестнадцетиричное число */
/*++++++ Это вещественное число +++++++++++*/
/*++++++ Это символ +++++++++++++++++++++++*/
/*Это символ алфавита*/
/*Это не буква и не символ*/
/*============================= Целые числа (%d) ========================================================*/

/*============================= Вещественные числа (%f) =================================================*/

/*============================= Строка (%s) =============================================================*/

/*============================= Hex, Oct целое число (%i) ===============================================*/

/*============================= Символ (%с) =============================================================*/

/*============================= Беззнаковое десятичное целое число (%u) =================================*/

/*============================= Вспомогательные функции =================================================*/
/*++++++ сравнение двух строк Ok+++++++++*/
int equal(const char* s1, const char* s2) {
    int i = 0;
    while(s1[i] != '\0') {
        if(s1[i] != s2[i]) {
            return (1);
        }
        i++;
    }
    return (0);
}

/*++++++++ строка в число OK +++++++++++*/
int to_int(const char* str) {
    int temp = str[0] - '0';
    int i = 1;

    while (str[i] != '\0') {
        temp = temp * 10 + str[i] -'0';
        i++;
    }
    return temp;
}