#include "../s21_string.h"
/*
 * Необходимо реализовать функцию sscanf из библиотеки stdio.h:
 *
 * Функция должна быть размещена в библиотеке s21_string.h.
 * На реализацию функции накладываются все требования, изложенные в первой части.
 * Должно поддерживаться частичное форматирование:
 *
 * Спецификаторы: c, d, i, f, s, u, %
 * Флаги: -, +, (пробел)
 * Ширина: (число)
 * Точность: .(число)
 * Длина: h, l
 *
 * s21_scanf(строка_из_которой_происходит_ввод, "строка_формат(спецификаторы)", &переременные, ...)
 * */
/*============================= Структра списка  ==========================================*/
typedef struct sscan_format{
    char type[50];
    void *info;
    int index;
    void *next;
} s_f;
/*============================= Прототипы функций ==========================================*/

/*============================= Реализация Основной функции ================================*/
int s21_sscanf(const char *str, const char *format,...) {

}

/*============================= Проверки ================================================================*/
/*Это целое число*/
/*Это дробное число*/
/*Это буква*/
/*Это символ алфавита*/
/*Это не буква и не символ*/
/*============================= Целые числа (%d) ========================================================*/

/*============================= Вещественные числа (%f) =================================================*/

/*============================= Строка (%s) =============================================================*/